app/controllers/account_activations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "jwr1050@gmail.com"]]
---
  def edit
    user = User.find_by(email: params[:email])