app/controllers/password_resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "hype@fresh.com"]]
---
  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)