app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "title", "picture", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "JAi GURUDEV"], ["title", "JAI GURU"], ["picture", "Gurudev_standing.jpg"], ["user_id", 1], ["created_at", "2016-07-10 18:47:46.730152"], ["updated_at", "2016-07-10 18:47:46.730152"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save