app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @posts = @user.posts.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1  ORDER BY "posts"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "gandalf "], ["password_digest", "$2a$10$RNCAqzZdint3kQ.7apfEke6vvwbU8zrZv5UMTMrWsFRr19yPBeLwS"], ["updated_at", "2016-07-08 21:35:20.363527"], ["id", 1]]

  def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]